## ----setup, include=FALSE------------------------------
knitr::opts_chunk$set(echo = TRUE)


## ------------------------------------------------------
# শুরু 
print("Hello World")

## ------------------------------------------------------
# ড্যাটা লোড করা 
data("mtcars")

## ------------------------------------------------------
# প্রথম ৬ টি রো দেখা 
head(mtcars)

## ------------------------------------------------------
# শেষ  ৬ টি রো দেখা 
tail(mtcars)

## ------------------------------------------------------
# রো এর সংখ্যা 
nrow(mtcars)

## ------------------------------------------------------
# কলাম এর সংখ্যা 
ncol(mtcars)

## ------------------------------------------------------
# রো এবং কলাম এর সংখ্যা 
dim(mtcars)

## ------------------------------------------------------
# সামারি স্ট্যাটিসটিক্স 
summary(mtcars)

## ------------------------------------------------------
# # দিয়ে শুরু লাইন কমেন্ট 
# $ দিয়ে ভ্যারিয়েবল সিলেক্ট করা হয় 
mtcars$disp
summary(mtcars$disp)



## ------------------------------------------------------

# ? দিয়ে হেল্প দেখা হয় 

?summary

## ------------------------------------------------------
# কোয়ান্টাইল
quantile(mtcars$mpg, 0.45)

## ------------------------------------------------------
#  রো এর নাম দেখা  
rownames(mtcars)


## ------------------------------------------------------

# প্লট 
# plot
# xlab = xlabel
# ylab = ylabel
# main = Plot title
plot(mtcars$mpg, mtcars$cyl)
plot(mtcars$mpg, mtcars$cyl,
     xlab = "Milage",
     ylab = "Cylindar Size",
     main= "Milage vs Cylinader")
hist(mtcars$mpg)


## ------------------------------------------------------

# প্যাকেজ ইনস্টল করা 
install.packages("ggplot2",repos = "http://cran.us.r-project.org")
# প্যাকেজ লোড করা 
library(ggplot2)
# library(abcd) কাজ করবে না 

# ggplot2 প্লট 
ggplot(mtcars, aes(mpg, wt))+geom_point()+
    theme_classic()


